create database radiorec character set utf8mb4;

create table radiorec.programs (
  id int auto_increment not null primary key,
  name varchar(512),
  cast varchar(255),
  day_of_week int not null,
  start_time time not null,
  airtime int not null,
  station int not null,
  on_air_status int not null default 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

create table radiorec.program_contents (
  id int auto_increment not null primary key,
  program_id int not null,
  video_path varchar(512),
  created_at datetime not null,
  updated_at timestamp DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- seed
INSERT INTO `programs` (`id`, `name`, `cast`, `day_of_week`, `start_time`, `airtime`, `station`, `on_air_status`)
VALUES
	(1,'佐倉としたい大西','佐倉綾音,大西沙織',2,'23:30:00',1800,1,1),
	(2,'井口裕香のむ〜〜〜ん','井口裕香',1,'22:00:00',3600,1,1),
	(3,'西明日香のデリケートゾーン','西明日香',2,'01:00:00',1800,1,1),
	(4,'花澤香菜のひとりでできるかな？','花澤香菜',4,'23:00:00',1800,1,1),
	(5,'早見沙織のふり～すたいる','早見沙織',5,'01:30:00',1800,1,1),
	(6,'上坂すみれの♡をつければ可愛かろう','上坂すみれ',0,'00:00:00',1800,2,1),
	(7,'水瀬いのりのmelody flag','水瀬いのり',0,'22:00:00',1800,2,1),
	(8,'碧と彩奈のラ・プチミレディオ flag','悠木碧,竹達彩奈',0,'22:30:00',1800,2,0),
	(9,'内田真礼のおはなししません？','内田真礼',2,'23:00:00',1800,1,1),
	(10,'村川梨衣の a りえしょんぷり〜ず','村川梨衣',2,'19:30:00',1800,1,1),
	(11,'内田雄馬 君の話を焼かせて','内田雄馬',3,'21:00:00',1800,1,0),
	(12,'洲崎西','洲崎綾,西明日香',3,'01:00:00',1800,1,1),
	(13,'大橋彩香のAny Beats!','大橋彩香',3,'19:00:00',1800,1,0),
	(14,'花澤香菜・内山夕実のクロ香菜さんとシロ夕実さん','花澤香菜,内山夕実',1,'19:30:00',1800,1,0),
	(15,'鷲崎健のヨルナイトxヨルナイト','鷲崎健',2,'00:00:00',3600,1,1),
	(16,'鷲崎健のヨルナイトxヨルナイト','鷲崎健',3,'00:00:00',3600,1,1),
	(17,'鷲崎健のヨルナイトxヨルナイト','鷲崎健',4,'00:00:00',3600,1,1),
	(18,'鷲崎健のヨルナイトxヨルナイト','鷲崎健',5,'00:00:00',3600,1,1),
	(19,'小倉唯のyui※room','小倉唯',1,'00:30:00',1800,2,1),
	(20,'三澤紗千香のラジオを聴くじゃんね！','三澤紗千香',5,'02:00:00',1800,1,0),
	(21,'徳井青空のまぁるくなぁれ！','徳井青空',5,'01:00:00',1800,1,1),
	(22,'飛べっ！石飛！','石飛恵里花',0,'19:00:00',1800,1,1),
	(23,'久保ユリカが１人しゃべり なんて胃が痛い。','久保ユリカ',5,'01:30:00',1800,1,0),
	(24,'スターラジオーシャン アナムネシス','中村悠一,マフィア梶田',3,'21:30:00',1800,1,0),
	(25,'本渡楓と天津向の「本渡上陸作戦」','本渡楓,天津向',1,'21:30:00',1800,1,1),
	(26,'アニゲラ！ディドゥーーン！！！','杉田智和,マフィア梶田,有象無象',4,'21:00:00',1800,1,0),
	(27,'竹達・沼倉の初ラジ！','竹達彩奈,沼倉愛美',4,'23:30:00',1800,1,1),
	(28,'宮崎由加のPinky Friday','宮崎由加',5,'18:00:00',6,3,1);